src/Documents/ОтгрузкаТовараКлиенту/ОтгрузкаТовараКлиенту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтгрузкаТовараКлиенту</name>
  <basedOn>Document.ЗаказКлиента</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваров</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦенНоменклатуры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.ТипКоличество</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.ТипЦена</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ТипСумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/ПартииТоваров/ПартииТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПартииТоваров</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.ТипКоличество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ТипСумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DocumentRef.ПриходТовараНаСклад</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ОстаткиТоваров/ОстаткиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТоваров</name>
  <resources>
    <name>Свободно</name>
    <type>
      <types>DefinedType.ТипКоличество</types>
    </type>
  </resources>
  <resources>
    <name>Резерв</name>
    <type>
      <types>DefinedType.ТипКоличество</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/ОтгрузкаТовараКлиенту/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)	
	УправляемаяБлокировка = Новый БлокировкаДанных();
    ЭлементБлокировки = Управляемаяблокировка.Добавить("РегистрНакопления.ПартииТоваров");
    ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
    ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
    ЭлементБлокировки.ИсточникДанных = Товары;
    ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	Попытка
    	УправляемаяБлокировка.Заблокировать();
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не удалось заблокировать регистр ""Партии товаров""";
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат;
	КонецПопытки;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.Ссылка.Склад КАК Склад,
	|	Товары.Номенклатура КАК Номенклатура,
	|	СУММА(Товары.Количество) КАК Количество
	|ПОМЕСТИТЬ Товары
	|ИЗ
	|	Документ.ОтгрузкаТовараКлиенту.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка.Склад,
	|	Товары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.Склад КАК Склад,
	|	Товары.Номенклатура КАК Номенклатура,
	|	ПартииТоваровОстатки.Партия КАК Партия,
	|	Товары.Количество КАК Количество,
	|	ЕСТЬNULL(ПартииТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ЕСТЬNULL(ПартииТоваровОстатки.СуммаОстаток, 0) КАК СуммаОстаток
	|ИЗ
	|	Товары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваров.Остатки(
	|				&Граница,
	|				(Склад, Номенклатура) В
	|					(ВЫБРАТЬ
	|						Товары.Склад,
	|						Товары.Номенклатура
	|					ИЗ
	|						Товары КАК Товары)) КАК ПартииТоваровОстатки
	|		ПО (ПартииТоваровОстатки.Номенклатура = Товары.Номенклатура)
	|			И (ПартииТоваровОстатки.Склад = Товары.Склад)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПартииТоваровОстатки.Партия.Дата
	|ИТОГИ
	|	МАКСИМУМ(Количество),
	|	СУММА(КоличествоОстаток),
	|	СУММА(СуммаОстаток)
	|ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Граница", Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если ВыборкаНоменклатура.Количество > ВыборкаНоменклатура.КоличествоОстаток Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Недостаточно остатка: %1, требуется: %2 остаток: %3",
				ВыборкаНоменклатура.Номенклатура, 
				ВыборкаНоменклатура.Количество, 
				ВыборкаНоменклатура.КоличествоОстаток);
			Сообщение.Сообщить();
			//Отказ = Истина;
			//Прервать;
		КонецЕсли;
		
		ОсталосьСписать = ВыборкаНоменклатура.Количество;
		
		ВыборкаПартии = ВыборкаНоменклатура.Выбрать();
		Пока ВыборкаПартии.Следующий() Цикл
			МожноСписать = Мин(ОсталосьСписать, ВыборкаПартии.КоличествоОстаток);
			ОсталосьСписать = ОсталосьСписать - МожноСписать;
			
			Движение = Движения.ПартииТоваров.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Количество = МожноСписать;
			
			Движение.Номенклатура = ВыборкаПартии.Номенклатура;
			Движение.Склад = ВыборкаПартии.Склад;
			Движение.Партия = ВыборкаПартии.Партия;
			
			Если МожноСписать = ВыборкаПартии.КоличествоОстаток Тогда
				Движение.Сумма = ВыборкаПартии.СуммаОстаток;	
			Иначе
				 Движение.Сумма = (ВыборкаПартии.СуммаОстаток / ВыборкаПартии.КоличествоОстаток) * МожноСписать;
			КонецЕсли;
			
			Если ОсталосьСписать = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Движения.ПартииТоваров.Записывать = Истина; 
	
	Запрос = Новый Запрос();
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Товары.Ссылка.Дата КАК Период,
	|	Товары.Номенклатура КАК Номенклатура,
	|	Товары.Ссылка.Склад КАК Склад,
	|	Товары.Ссылка.ЗаказКлиента КАК ЗаказКлиента,
	|	СУММА(ВЫБОР
	|			КОГДА Товары.Ссылка.ЗаказКлиента.Ссылка ЕСТЬ NULL
	|				ТОГДА Товары.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Свободно,
	|	СУММА(ВЫБОР
	|			КОГДА НЕ Товары.Ссылка.ЗаказКлиента.Ссылка ЕСТЬ NULL
	|				ТОГДА Товары.Количество
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Резерв
	|ИЗ
	|	Документ.ОтгрузкаТовараКлиенту.Товары КАК Товары
	|ГДЕ
	|	Товары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Товары.Ссылка.Дата,
	|	Товары.Номенклатура,
	|	Товары.Ссылка.Склад,
	|	Товары.Ссылка.ЗаказКлиента";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Движения.ОстаткиТоваров.Загрузить(РезультатЗапроса.Выгрузить());	
	Движения.ОстаткиТоваров.Записывать = Истина;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Договор = ДанныеЗаполнения.Договор;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Склад = ДанныеЗаполнения.Склад;
		ЗаказКлиента = ДанныеЗаполнения.Ссылка; 
		ВидЦены = ДанныеЗаполнения.ВидЦены;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
